; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	image0 - mode
	spectrograph4 - mode
	spectrograph2 - mode
	image3 - mode
	spectrograph1 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star6 - direction
	Star7 - direction
	Star0 - direction
	GroundStation5 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph1)
	(supports instrument1 image3)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon13)
	(supports instrument2 image0)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star0)
	(supports instrument3 spectrograph4)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet14)
)
(:goal (and
	(pointing satellite0 GroundStation5)
	(have_image Planet8 spectrograph2)
	(have_image Phenomenon9 image3)
	(have_image Star10 spectrograph4)
	(have_image Phenomenon11 spectrograph2)
	(have_image Planet12 spectrograph1)
	(have_image Phenomenon13 spectrograph4)
	(have_image Planet14 image3)
	(have_image Planet15 image0)
))

)

; plan
1. (turn_to satellite1 groundstation5 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 groundstation5)
   goals met: 0 of 9
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 9
3. (calibrate satellite1 instrument2 groundstation5)
   added: (calibrated instrument2)
   goals met: 0 of 9
4. (turn_to satellite1 planet15 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 planet15)
   goals met: 0 of 9
5. (take_image satellite1 planet15 instrument2 image0)
   added: (have_image planet15 image0)
   goals met: 1 of 9
6. (turn_to satellite1 planet12 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet12)
   goals met: 1 of 9
7. (take_image satellite1 planet12 instrument2 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 2 of 9
8. (turn_to satellite1 phenomenon11 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 9
9. (turn_to satellite0 groundstation5 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 groundstation5)
   goals met: 3 of 9
10. (take_image satellite1 phenomenon11 instrument2 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 4 of 9
11. (turn_to satellite1 planet8 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet8)
   goals met: 4 of 9
12. (take_image satellite1 planet8 instrument2 spectrograph2)
   added: (have_image planet8 spectrograph2)
   goals met: 5 of 9
13. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 5 of 9
14. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 5 of 9
15. (turn_to satellite1 groundstation3 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation3)
   goals met: 5 of 9
16. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 5 of 9
17. (turn_to satellite1 phenomenon13 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon13)
   goals met: 5 of 9
18. (take_image satellite1 phenomenon13 instrument3 spectrograph4)
   added: (have_image phenomenon13 spectrograph4)
   goals met: 6 of 9
19. (turn_to satellite1 phenomenon9 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon9)
   goals met: 6 of 9
20. (take_image satellite1 phenomenon9 instrument3 image3)
   added: (have_image phenomenon9 image3)
   goals met: 7 of 9
21. (turn_to satellite1 planet14 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet14)
   goals met: 7 of 9
22. (take_image satellite1 planet14 instrument3 image3)
   added: (have_image planet14 image3)
   goals met: 8 of 9
23. (turn_to satellite1 star10 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star10)
   goals met: 8 of 9
24. (take_image satellite1 star10 instrument3 spectrograph4)
   added: (have_image star10 spectrograph4)
   goals met: 9 of 9
